Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Guid Property
 A unique identifier of the actual shape, given initially by the ShapeCatalog. This GUID is used as the body of the filename for the shape information found in the Shape directory
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Guid { get; }
Public ReadOnly Property Guid As String
	Get
Property Value
Type: String
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace